# IndexPrimitive Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IndexPrimitive Class
Members See Also
---
The base class for index buffer primitives.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public class IndexPrimitive : IDisposable
```

Visual Basic
---
```text
Public Class IndexPrimitive _
	Implements IDisposable
```

Visual C++
---
```text
public ref class IndexPrimitive : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.DirectContext3D..::..IndexPrimitive Autodesk.Revit.DB.DirectContext3D..::..IndexLine Autodesk.Revit.DB.DirectContext3D..::..IndexPoint Autodesk.Revit.DB.DirectContext3D..::..IndexTriangle
# See Also
IndexPrimitive Members
Autodesk.Revit.DB.DirectContext3D Namespace